lisp/clbe/clbe-6.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Blocks</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<h1 class="title">Blocks</h1>
<p>
Previous: <a href="clbe-5.html">5. Global Functions</a>
</p>

<p>
Next: <a href="clbe-7.html">7. Data Types</a>
</p>

<p>
Until now we have been working with singular Lisp forms. Frequently
however, we want to evaluate a block of code together, such as within
functions, or within an if statement or a loop. The PROGN special
operator allows us to evaluate a sequence of Lisp forms in order and
return the value of the last as the value of the PROGN form. Below is
an example:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns 10</span>

(<span style="color: #a020f0;">progn</span>
  (print <span style="color: #8b2252;">"Hello"</span>)
  (print <span style="color: #8b2252;">"World"</span>)
  (+ 5 5))

</pre>
</div>

<p>
The BLOCK special operator is similar, but it is named and has a
mechanism for out-of-order exit with the RETURN-FROM operator. As
mentioned earlier, the bodies of functions are wrapped in an implicit
BLOCK.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns 10</span>

(<span style="color: #a020f0;">block</span> my-block
  (print <span style="color: #8b2252;">"We see this"</span>)
  (<span style="color: #a020f0;">return-from</span> my-block 10)
  (print <span style="color: #8b2252;">"We will never see this"</span>))

</pre>
</div>

<p>
The RETURN macro returns its argument as the value of an enclosing
BLOCK named NIL.  Many Common Lisp operators that take a body of
expressions implicitly enclose the body in a BLOCK named NIL and we
can use RETURN in these forms:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns 10 when 1 = 3 and</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">prints 1 and 2</span>

(<span style="color: #a020f0;">dolist</span> (i '(1 2 3 5 6 7))
  (<span style="color: #a020f0;">if</span> (= i 3)
      (<span style="color: #a020f0;">return</span> 10))
  (print i))

</pre>
</div>

<p>
The value of the last expression is returned by the block (unless
modified by RETURN or RETURN-FROM). All other expressions in the block
are thus only useful for their side effects.
</p>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
